# Pandas
### Karl N. Kirschner

"...providing fast, flexible, and expressive data structures designed to make working with “relational” or “labeled” data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python." -- http://pandas.pydata.org/pandas-docs/stable/

- Tabular data with heterogeneously-typed columns, (CSV, SQL, or Excel spreadsheet)
- Ordered and unordered time series data.
- Arbitrary matrix data with row and column labels


**Significant things to note**:
- Data structures
    - Series - 1 dimensional data
    - DataFrame - 2 dimensional data
- Missing data - NaN


Additional source:
1. Wes McKinney, Python for Data Analysis; Data Wrangling with Pandas, Numpy and Ipython, O'Reilly, Second Edition, 2018.
***

In [1]:
import matplotlib.pyplot as plt
import pandas as pd

## Pandas Series

Series contain two components:
1. one-dimensional array-like object that contains a sequence of data values
2. an associated array of data labels (i.e. 'index')

Note: indexes start at '0'

In [2]:
## Not the capital 'S' in 'Series'
series_data_1 = pd.Series([5, 10, 15, 20, 25])
series_data_1

0     5
1    10
2    15
3    20
4    25
dtype: int64

In [3]:
## access only the values
series_data_1.values

array([ 5, 10, 15, 20, 25])

In [4]:
series_data_2 = pd.Series([5, 10, 15, 20, 25], index=['d', 'e', 'a', 'simulation', 'average'])
series_data_2

d              5
e             10
a             15
simulation    20
average       25
dtype: int64

In [5]:
## Alter the name of the indexes
series_data_2.index = ['Norway', 'Italy', 'Germany', 'simulation', 'average']
series_data_2

Norway         5
Italy         10
Germany       15
simulation    20
average       25
dtype: int64

In [6]:
## Access data via index label
series_data_2['simulation']

20

In [7]:
series_data_2[3]

20

In [8]:
## Filter the data
series_data_2[series_data_2 >= 15]

Germany       15
simulation    20
average       25
dtype: int64

In [9]:
## Using operators
series_data_2 ** 2

Norway         25
Italy         100
Germany       225
simulation    400
average       625
dtype: int64

In [10]:
series_data_2 + series_data_2

Norway        10
Italy         20
Germany       30
simulation    40
average       50
dtype: int64

In [11]:
## Sorting by index
series_data_2.sort_index()

Germany       15
Italy         10
Norway         5
average       25
simulation    20
dtype: int64

What happens when one of the series has missing data (e.g. the Italian data is not present)?

In [12]:
series_data_3 = pd.Series([5, 10, 20, 25], index=['Germany', 'Norway', 'simulation', 'average'])

series_data_2 + series_data_3

Germany       20.0
Italy          NaN
Norway        15.0
average       50.0
simulation    40.0
dtype: float64

---
## Dataframes
- dataframes represents a **rectangular, ordered** table of data (numbers, strings, etc.)
    - just like you are familiar with in a spreedsheet

In [13]:
## Create 'by hand'

## via a dictionary of equal lengths
data = {'group': ['Deichkind', 'Die Fantastischen Vier', 'Seeed', 'Paul van Dyk'],
                'year': [2015, 2106, 2017, 2018],
                'attendence (x1000)': [50, 60, 70, 90]}

## convert the dictionary to a pandas' dataframe
example_df = pd.DataFrame(data) 

example_df

                    group  year  attendence (x1000)
0               Deichkind  2015                  50
1  Die Fantastischen Vier  2106                  60
2                   Seeed  2017                  70
3            Paul van Dyk  2018                  90

In [14]:
example_df.index = ['band 1', 'band 2', 'band 3', 'band 4']

example_df

                         group  year  attendence (x1000)
band 1               Deichkind  2015                  50
band 2  Die Fantastischen Vier  2106                  60
band 3                   Seeed  2017                  70
band 4            Paul van Dyk  2018                  90

In [95]:
## Adding a new column
## Introduces NaN
example_df['Number of total concerts'] = pd.Series([10], index=[1])

example_df

,group,year,attendence (x1000),Number of total concerts
band 1,Deichkind,2015,50,NaN
band 2,Die Fantastischen Vier,2106,60,NaN
band 3,Seeed,2017,70,NaN
band 4,Paul van Dyk,2018,90,NaN

---
## Accessing, selecting and filtering data
- there are many ways to do this (df: dataframe)
    - df[val] - selects a single column (but not always -- see below for filtering rows)
    - df.loc[val]
    - df.loc[row_val, col_val]
    - df.iloc[row_index, col_index]
    - and more

In [96]:
## accessing a single column (by a column label)
example_df['group']

band 1                 Deichkind
band 2    Die Fantastischen Vier
band 3                     Seeed
band 4              Paul van Dyk
Name: group, dtype: object

In [97]:
## accessing a multiple column (passing a list to the dataframe)
## note the double [[ ]]
example_df[['group', 'year']]

                         group  year
band 1               Deichkind  2015
band 2  Die Fantastischen Vier  2106
band 3                   Seeed  2017
band 4            Paul van Dyk  2018

In [99]:
example_df[example_df.columns[0:2]]

                         group  year
band 1               Deichkind  2015
band 2  Die Fantastischen Vier  2106
band 3                   Seeed  2017
band 4            Paul van Dyk  2018

In [110]:
## accessing a row (index label)
example_df.loc['band 3']

group                       Seeed
year                         2017
attendence (x1000)             70
Number of total concerts      NaN
Name: band 3, dtype: object

In [111]:
## access a specific cell - by labels
example_df.loc['band 3', 'group']

'Seeed'

In [112]:
## or by index number
example_df.iloc[2, 0]

'Seeed'

### Filtering for selecting a range of columns

In [84]:
example_df

                         group  year  attendence (x1000)
band 1               Deichkind  2015                  50
band 2  Die Fantastischen Vier  2106                  60
band 3                   Seeed  2017                  70
band 4            Paul van Dyk  2018                  90

---
### Filtering for selecting a range of rows

In [20]:
## filter the table based on a row range
## Note: this can get confusing because of the way the pandas was setup
##    - multiple ways to do the same things (and unclear logic behaind it, IMO)

## Method 1
example_df[0:3]

,group,year,attendence (x1000),Number of total concerts
band 1,Deichkind,2015,50,NaN
band 2,Die Fantastischen Vier,2106,60,NaN
band 3,Seeed,2017,70,NaN

In [21]:
## Method 2
example_df['band 1':'band 3']

,group,year,attendence (x1000),Number of total concerts
band 1,Deichkind,2015,50,NaN
band 2,Die Fantastischen Vier,2106,60,NaN
band 3,Seeed,2017,70,NaN

In [22]:
## Method 3 (using the idea of .loc to access rows - seems most logical)
example_df.loc['band 1':'band 3']

,group,year,attendence (x1000),Number of total concerts
band 1,Deichkind,2015,50,NaN
band 2,Die Fantastischen Vier,2106,60,NaN
band 3,Seeed,2017,70,NaN

---
## Essential Functions

### Reindexing
- reordering the data rows

In [23]:
## create new dataframe
example_df_new = example_df.reindex(['band 3', 'band 4', 'band 1', 'band 2'])
example_df_new

,group,year,attendence (x1000),Number of total concerts
band 3,Seeed,2017,70,NaN
band 4,Paul van Dyk,2018,90,NaN
band 1,Deichkind,2015,50,NaN
band 2,Die Fantastischen Vier,2106,60,NaN

In [24]:
## overwrite existing dataframe
#example_df = example_df.reindex(['band 3', 'band 4', 'band 1', 'band 2'])
#example_df

---
### Dropping data entries
- pandas.drop will **drop columns** and **rows** using the **axis** keyword
    - axis='row' ; axis=0
    - axis='columns' ; axis=1

In [25]:
## remove a row (both of the following work)

#example_df_new = example_df.drop('band 1')
example_df_new = example_df.drop('band 1', axis='rows') # axis=0 also works
example_df_new

,group,year,attendence (x1000),Number of total concerts
band 2,Die Fantastischen Vier,2106,60,NaN
band 3,Seeed,2017,70,NaN
band 4,Paul van Dyk,2018,90,NaN

In [26]:
## remove multiple rows

example_df_new = example_df
example_df_new = example_df.drop(['band 1', 'band 3'])
example_df_new

,group,year,attendence (x1000),Number of total concerts
band 2,Die Fantastischen Vier,2106,60,NaN
band 4,Paul van Dyk,2018,90,NaN

In [27]:
example_df

,group,year,attendence (x1000),Number of total concerts
band 1,Deichkind,2015,50,NaN
band 2,Die Fantastischen Vier,2106,60,NaN
band 3,Seeed,2017,70,NaN
band 4,Paul van Dyk,2018,90,NaN

In [28]:
## delete a column - method 1

example_df_new = example_df

del example_df_new['Number of total concerts']
example_df_new

                         group  year  attendence (x1000)
band 1               Deichkind  2015                  50
band 2  Die Fantastischen Vier  2106                  60
band 3                   Seeed  2017                  70
band 4            Paul van Dyk  2018                  90

In [29]:
## delete a column - method 2
example_df_new = example_df.drop('attendence (x1000)', axis='columns') # axis=1 also works
example_df_new

                         group  year
band 1               Deichkind  2015
band 2  Die Fantastischen Vier  2106
band 3                   Seeed  2017
band 4            Paul van Dyk  2018

## Math operators
-

In [30]:
rectangle_dict_data = {'length': [0.1, 9.4, 6.2, 3.8, 1.5],
                'height': [8.7, 6.2, 9.4, 5.6, 3.3]}

rectangle_data = pd.DataFrame(rectangle_dict_data)

rectangle_data

   length  height
0     0.1     8.7
1     9.4     6.2
2     6.2     9.4
3     3.8     5.6
4     1.5     3.3

In [31]:
## math on a column
rectangle_data/10

   length  height
0    0.01    0.87
1    0.94    0.62
2    0.62    0.94
3    0.38    0.56
4    0.15    0.33

In [32]:
## math between columns (e.g. for the area of a rectangle)
rectangle_data['length'] * rectangle_data['height']

0     0.87
1    58.28
2    58.28
3    21.28
4     4.95
dtype: float64

In [33]:
## Create a new column based on math using other columns
rectangle_data['area']= rectangle_data['length'] * rectangle_data['height']

In [34]:
rectangle_data

   length  height   area
0     0.1     8.7   0.87
1     9.4     6.2  58.28
2     6.2     9.4  58.28
3     3.8     5.6  21.28
4     1.5     3.3   4.95

### Descriptive statistics
- Using **python built-in functions** (e.g. max, min, round)

In [35]:
max(rectangle_data['area'])

58.28

In [36]:
round(rectangle_data['area'], ndigits=1)

0     0.9
1    58.3
2    58.3
3    21.3
4     4.9
Name: area, dtype: float64

- Using **pandas functions**
    - count - number of non-NA values
    - sum, median, std, var
    - max, min
    - and many more

In [61]:
rectangle_data['area'].count()

5

In [38]:
rectangle_data['area'].mean()

28.732

### Unique values

In [77]:
rectangle_data['area'].value_counts()

58.28    2
4.95     1
0.87     1
21.28    1
Name: area, dtype: int64

- using **other libraries** (e.g. statistics)

In [39]:
import statistics
## basic statistical analsysi also works
statistics.mean(rectangle_data['area'])

28.732

### sorting dataframes
- sorting by index
    - must specify the axis for sorting their labels

In [40]:
## sorting
rectangle_data.sort_index(axis='columns', ascending=True)

    area  height  length
0   0.87     8.7     0.1
1  58.28     6.2     9.4
2  58.28     9.4     6.2
3  21.28     5.6     3.8
4   4.95     3.3     1.5

In [41]:
rectangle_data.sort_index(axis='rows', ascending=False)

   length  height   area
4     1.5     3.3   4.95
3     3.8     5.6  21.28
2     6.2     9.4  58.28
1     9.4     6.2  58.28
0     0.1     8.7   0.87

- sort by column values

In [42]:
rectangle_data.sort_values(by='area')

   length  height   area
0     0.1     8.7   0.87
4     1.5     3.3   4.95
3     3.8     5.6  21.28
1     9.4     6.2  58.28
2     6.2     9.4  58.28

- sort by multiple columns
    - consecutively done

In [43]:
## rows index 1 and 2 should switch due to length value
rectangle_data.sort_values(by=['area', 'length'])

   length  height   area
0     0.1     8.7   0.87
4     1.5     3.3   4.95
3     3.8     5.6  21.28
2     6.2     9.4  58.28
1     9.4     6.2  58.28

### filter by boolean operators

In [119]:
rectangle_data

   length  height   area
0     0.1     8.7   0.87
1     9.4     6.2  58.28
2     6.2     9.4  58.28
3     3.8     5.6  21.28
4     1.5     3.3   4.95

In [120]:
rectangle_data['area'] > 7.0

0    False
1     True
2     True
3     True
4    False
Name: area, dtype: bool

In [126]:
## single boolean condition
rectangle_data[rectangle_data['area'] > 7.0]

   length  height   area
1     9.4     6.2  58.28
2     6.2     9.4  58.28
3     3.8     5.6  21.28

In [125]:
## multiple boolean conditions
rectangle_data[ (rectangle_data['area'] > 7.0) & (rectangle_data['area'] < 50.0) ]

   length  height   area
3     3.8     5.6  21.28

---
## Data from a 3D csv-formatted file

In [ ]:
## CSV data file acan be found at
## https://github.com/karlkirschner/2020_Scientific_Programming/blob/master/data_3d.csv

## For Colabs

## In order to upload data
#from google.colab import files
#uploaded = files.upload()

In [128]:
!head data_3d.csv --lines=10

Time,Exp,Theory
0.0,0.1185,0.2255
0.5,0.6524,0.3052
1.0,0.1291,0.0744
1.5,0.9445,0.7611
2.0,0.0272,0.1183
2.5,0.7598,0.0450
3.0,0.8159,0.2669
3.5,0.8003,0.1770
4.0,0.5716,0.2433

In [130]:
df = pd.read_csv('data_3d.csv', header=None, sep=',')
df

       0       1       2
0   Time     Exp  Theory
1    0.0  0.1185  0.2255
2    0.5  0.6524  0.3052
3    1.0  0.1291  0.0744
4    1.5  0.9445  0.7611
5    2.0  0.0272  0.1183
6    2.5  0.7598  0.0450
7    3.0  0.8159  0.2669
8    3.5  0.8003  0.1770
9    4.0  0.5716  0.2433
10   4.5  0.6651  0.2302
11   5.0  0.9983  0.0772
12   5.5  0.1004  0.0805
13   6.0  0.8433  0.6214
14   6.5  0.0067  0.1156
15   7.0  0.8238  0.1607
16   7.5  0.3952  0.0420
17   8.0  0.6452  0.1123
18   8.5  0.8480  0.3830
19   9.0  0.1986  0.5566
20   9.5  0.9114  0.6670
21  10.0  0.7693  0.5655
22  10.5  0.5009  0.4875
23  11.0  0.2110  0.0104
24  11.5  0.9227  0.4968
25  12.0  0.0461  0.2639
26  12.5  0.2177  0.2197
27  13.0  0.9554  0.9440
28  13.5  0.6130  0.2423

In [131]:
## Read in a csv file, using the first row (i.e. 0) as the header, with a comma separator
df = pd.read_csv('data_3d.csv', header=0, sep=',')

df

    Time     Exp  Theory
0    0.0  0.1185  0.2255
1    0.5  0.6524  0.3052
2    1.0  0.1291  0.0744
3    1.5  0.9445  0.7611
4    2.0  0.0272  0.1183
5    2.5  0.7598  0.0450
6    3.0  0.8159  0.2669
7    3.5  0.8003  0.1770
8    4.0  0.5716  0.2433
9    4.5  0.6651  0.2302
10   5.0  0.9983  0.0772
11   5.5  0.1004  0.0805
12   6.0  0.8433  0.6214
13   6.5  0.0067  0.1156
14   7.0  0.8238  0.1607
15   7.5  0.3952  0.0420
16   8.0  0.6452  0.1123
17   8.5  0.8480  0.3830
18   9.0  0.1986  0.5566
19   9.5  0.9114  0.6670
20  10.0  0.7693  0.5655
21  10.5  0.5009  0.4875
22  11.0  0.2110  0.0104
23  11.5  0.9227  0.4968
24  12.0  0.0461  0.2639
25  12.5  0.2177  0.2197
26  13.0  0.9554  0.9440
27  13.5  0.6130  0.2423

For files without a header you can:
1. have pandas assign an index value as the header (e.g. 1 2 3)
2. assign the headers yourself
    - df = pd.read_csv('data_file.csv', sep=',', names=['header 1', 'header 2', 'average'])

In [127]:
## Save data to a new csv file, printing out to the first decimal place
df.to_csv('pandas_out.csv',
          sep=',', float_format='%.1f',
          index=False, encoding='utf-8')

---
## Pandas to Latex
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_latex.html

In [59]:
print(df_merge.to_latex(index=False))

\begin{tabular}{rrrrrrrr}
\toprule
 Time &     Exp &  Theory &  Times2 &  Time &      Exp &   Theory &  Times2 \\
\midrule
  0.0 &  0.1185 &  0.2255 &  0.4510 &   0.0 &  0.59250 &  1.12750 &  0.4510 \\
  0.5 &  0.6524 &  0.3052 &  0.6104 &   0.5 &  3.26200 &  1.52600 &  0.6104 \\
  1.0 &  0.1291 &  0.0744 &  0.1488 &   1.0 &  0.64550 &  0.37200 &  0.1488 \\
  1.5 &  0.9445 &  0.7611 &  1.5222 &   1.5 &  4.72250 &  3.80550 &  1.5222 \\
  2.0 &  0.0272 &  0.1183 &  0.2366 &   2.0 &  0.13600 &  0.59150 &  0.2366 \\
  2.5 &  0.7598 &  0.0450 &  0.0900 &   2.5 &  3.79900 &  0.22500 &  0.0900 \\
  3.0 &  0.8159 &  0.2669 &  0.5338 &   3.0 &  4.07950 &  1.33450 &  0.5338 \\
  3.5 &  0.8003 &  0.1770 &  0.3540 &   3.5 &  4.00150 &  0.88500 &  0.3540 \\
  4.0 &  0.5716 &  0.2433 &  0.4866 &   4.0 &  2.85800 &  1.21650 &  0.4866 \\
  4.5 &  0.6651 &  0.2302 &  0.4604 &   4.5 &  3.32550 &  1.15100 &  0.4604 \\
  5.0 &  0.9983 &  0.0772 &  0.1544 &   5.0 &  4.99150 &  0.38600 &  0.1544 \\
  5.5 &  0.1004 &  0.0805 &  0.1610 &   5.5 &  0.50200 &  0.40250 &  0.1610 \\
  6.0 &  0.8433 &  0.6214 &  1.2428 &   6.0 &  4.21650 &  3.10700 &  1.2428 \\
  6.5 &  0.0067 &  0.1156 &  0.2312 &   6.5 &  0.03350 &  0.57800 &  0.2312 \\
  7.0 &  0.8238 &  0.1607 &  0.3214 &   7.0 &  4.11900 &  0.80350 &  0.3214 \\
  7.5 &  0.3952 &  0.0420 &  0.0840 &   7.5 &  0.07904 &  0.00840 &  0.0840 \\
  8.0 &  0.6452 &  0.1123 &  0.2246 &   8.0 &  0.12904 &  0.02246 &  0.2246 \\
  8.5 &  0.8480 &  0.3830 &  0.7660 &   8.5 &  0.16960 &  0.07660 &  0.7660 \\
  9.0 &  0.1986 &  0.5566 &  1.1132 &   9.0 &  0.03972 &  0.11132 &  1.1132 \\
  9.5 &  0.9114 &  0.6670 &  1.3340 &   9.5 &  0.18228 &  0.13340 &  1.3340 \\
 10.0 &  0.7693 &  0.5655 &  1.1310 &  10.0 &  0.15386 &  0.11310 &  1.1310 \\
 10.5 &  0.5009 &  0.4875 &  0.9750 &  10.5 &  0.10018 &  0.09750 &  0.9750 \\
 11.0 &  0.2110 &  0.0104 &  0.0208 &  11.0 &  0.04220 &  0.00208 &  0.0208 \\
 11.5 &  0.9227 &  0.4968 &  0.9936 &  11.5 &  0.18454 &  0.09936 &  0.9936 \\
 12.0 &  0.0461 &  0.2639 &  0.5278 &  12.0 &  0.00922 &  0.05278 &  0.5278 \\
 12.5 &  0.2177 &  0.2197 &  0.4394 &  12.5 &  0.04354 &  0.04394 &  0.4394 \\
 13.0 &  0.9554 &  0.9440 &  1.8880 &  13.0 &  0.19108 &  0.18880 &  1.8880 \\
 13.5 &  0.6130 &  0.2423 &  0.4846 &  13.5 &  0.12260 &  0.04846 &  0.4846 \\
\bottomrule
\end{tabular}

***
## Import Data from a European data csv file (e.g. 1,0 \t 2,3)

In [ ]:
## CSV data file acan be found at
## https://github.com/karlkirschner/2020_Scientific_Programming/blob/master/data_eu.csv

## For Colabs

## In order to upload data
#from google.colab import files
#uploaded = files.upload()

In [132]:
!head data_eu.csv --lines=10

Time;Exp;Theory;Value
0,0;0,1185;0,226;10.135,11
0,5;0,6524;0,305;11.106,23
1,0;0,1291;0,074;12.347,45
1,5;0,9445;0,761;18.421,76
2,0;0,0272;0,118;13.551,78
2,5;0,7598;0,045;14.827,12
3,0;0,8159;0,267;14.305,56
3,5;0,8003;0,177;10.908,72
4,0;0,5716;0,243;11.106,23

In [135]:
df = pd.read_csv('data_eu.csv', decimal=',', thousands='.', sep=';')
df.columns
df['Value']

0     10135.11
1     11106.23
2     12347.45
3     18421.76
4     13551.78
5     14827.12
6     14305.56
7     10908.72
8     11106.23
9     12347.45
10    18421.76
11    13551.78
12    14827.12
13    14305.56
14    10908.72
15    11106.23
16    12347.45
17    18421.76
18    13551.78
19    14827.12
20    14305.56
21    10908.72
22    11106.23
23    12347.45
24    18421.76
25    13551.78
26    14827.12
27    14305.56
Name: Value, dtype: float64